---
kind: other
id: Properties.T:Autodesk.Revit.DB.FailuresAccessor
source: html/214c2815-2915-836b-deed-3a2b38cdf558.htm
---
# FailuresAccessor Properties

Specifies whether the .NET object represents a valid Revit entity.